---
kind: type
id: T:Autodesk.Revit.DB.Lighting.LightFamily
source: html/53ebee14-8d6f-28ac-f44e-1e7bd906c7d8.htm
---
# Autodesk.Revit.DB.Lighting.LightFamily

This class encapsulates light family information.

## Syntax (C#)
```csharp
public class LightFamily : IDisposable
```